app/Controllers/AlmacenController.php

    public function index()
    {
        $alma=new ModelAlma();


        $datos['z']=$alma->select('tb_almacen.id_almacen,
          tb_almacen.id_producto,tb_almacen.fecha,tb_almacen.seccion,
          tb_producto.producto,
          tb_producto.stock,
          tb_producto.categoria,tb_producto.marca,tb_producto.codigo ')
          ->join('tb_producto', 'tb_almacen.id_producto = tb_producto.id_producto')
          ->findAll();
---
SELECT `tb_almacen`.`id_almacen`, `tb_almacen`.`id_producto`, `tb_almacen`.`fecha`, `tb_almacen`.`seccion`, `tb_producto`.`producto`, `tb_producto`.`stock`, `tb_producto`.`categoria`, `tb_producto`.`marca`, `tb_producto`.`codigo`
FROM `tb_almacen`
JOIN `tb_producto` ON `tb_almacen`.`id_producto` = `tb_producto`.`id_producto`