app/Controllers/ClienteController.php

SELECT *
FROM `tb_cliente`
ORDER BY `id_cliente` ASC
---
    public function index()
    {
        $cliente=new ModelClien();
        $datos['s']=$cliente->orderBy('id_cliente','ASC')->findAll();

SELECT *
FROM `tb_cliente`
ORDER BY `id_cliente` ASC
---
    public function guardar(){
        $pro=new ModelClien();

        $datos=[
        'nombre'=>$this->request->getVar('nom'),
        'apellido'=>$this->request->getVar('ape'),
        'celular'=>$this->request->getVar('cel'),
        'DNI'=>$this->request->getVar('DNI'),
        'direccion'=>$this->request->getVar('dir'),
        ];
        $pro->insert($datos);

        $datos['s']=$pro->orderBy('id_cliente','ASC')->findAll();