app/Controllers/ComprasController.php

SELECT `tb_compra`.`idcompra`, `tb_producto`.`producto`, `tb_producto`.`codigo`, `tb_compra`.`numcomproban`, `tb_compra`.`fecha`, `tb_compra`.`cantidad`, `tb_compra`.`precio`, `tb_compra`.`total`, `tb_cliente`.`nombre`
FROM `tb_compra`
JOIN `tb_producto` ON `tb_compra`.`id_producto`=`tb_producto`.`id_producto`
JOIN `tb_cliente` ON `tb_compra`.`id_cliente`=`tb_cliente`.`id_cliente`
ORDER BY `idcompra` ASC
---
    public function index()
    {
        $compra=new ModelCompra();

        $datos['s']=$compra->select('tb_compra.idcompra,tb_producto.producto,tb_producto.codigo,
          tb_compra.numcomproban,tb_compra.fecha,tb_compra.cantidad,tb_compra.precio,tb_compra.total,
         tb_cliente.nombre')
         ->join('tb_producto','tb_compra.id_producto=tb_producto.id_producto')
         ->join('tb_cliente','tb_compra.id_cliente=tb_cliente.id_cliente')
         ->orderBy('idcompra','ASC')
         ->findAll();