app/Controllers/ProductoController.php

    public function index()
    {
        $producto= new ModelProducto();
        $datos['s']=$producto->orderBy('id_producto','ASC')->findAll();
---
SELECT *
FROM `tb_producto`
ORDER BY `id_producto` ASC