app/Controllers/VentasController.php

    public function editar(){
        $venta=new ModelVentas();
        $pro=new ModelProducto();

        $uno=$this->request->getVar('can');
        $precio=$this->request->getVar('pre');
        $total=$uno*$precio;

        $idpro=$this->request->getVar('pro');
        $idven=$this->request->getVar('idcompra');

        $stockpro=$pro->select('stock')
                      ->where('id_producto',$idpro)
                      ->first();
        $canventas=$venta->select('cantidad')
                        ->where('id_boleta',$idven)
                        ->first();
---
SELECT `cantidad`
FROM `tb_boleta`
WHERE `id_boleta` = '6'
 LIMIT 1