app/Controllers/VentasController.php

SELECT `tb_boleta`.`id_boleta`, `tb_boleta`.`id_cliente`, `tb_boleta`.`id_producto`, `tb_boleta`.`fecha`, `tb_boleta`.`RUC`, `tb_boleta`.`descripcion`, `tb_boleta`.`comprobante`, `tb_boleta`.`cantidad`, `tb_boleta`.`precio`, `tb_boleta`.`total`, `tb_producto`.`producto`, `tb_cliente`.`nombre`
FROM `tb_boleta`
JOIN `tb_producto` ON `tb_boleta`.`id_producto`=`tb_producto`.`id_producto`
JOIN `tb_cliente` ON `tb_boleta`.`id_cliente`=`tb_cliente`.`id_cliente`
ORDER BY `id_boleta` ASC
---
    public function index()
    {
        $ven=new ModelVentas();

        $datos['s']=$ven->select('tb_boleta.id_boleta,tb_boleta.id_cliente,tb_boleta.id_producto,tb_boleta.fecha,
        tb_boleta.RUC,tb_boleta.descripcion,tb_boleta.comprobante,tb_boleta.cantidad,tb_boleta.precio,
        tb_boleta.total,tb_producto.producto,tb_cliente.nombre')
         ->join('tb_producto','tb_boleta.id_producto=tb_producto.id_producto')
         ->join('tb_cliente','tb_boleta.id_cliente=tb_cliente.id_cliente')
         ->orderBy('id_boleta','ASC')
         ->findAll();

SELECT `stock`, `precio`
FROM `tb_producto`
WHERE `id_producto` = '29'
 LIMIT 1
SELECT `cantidad`
FROM `tb_boleta`
WHERE `id_boleta` = '13'
 LIMIT 1
---
    public function editar(){
        $venta=new ModelVentas();
        $pro=new ModelProducto();

        $idpro=$this->request->getVar('pro');

        $stockpro=$pro->select('stock,precio')
        ->where('id_producto',$idpro)
        ->first();

        $uno=$this->request->getVar('can');
        $total=$uno*$stockpro['precio'];


        $idven=$this->request->getVar('idcompra');


        $canventas=$venta->select('cantidad')
                        ->where('id_boleta',$idven)
                        ->first();