app/Models/AdminModel.php

    public function productosMasVendidos() : array
    {
        $this->builder->select('tb_producto.producto, SUM(tb_compra.cantidad) as  suma');
        $this->builder->join('tb_producto', 'tb_compra.id_producto = tb_producto.id_producto');
        $this->builder->groupBy('tb_producto.producto');
        $this->builder->orderBy('tb_producto.producto', 'DESC');
        $r = $this->builder->get()->getResultObject();
---
SELECT `tb_producto`.`producto`, SUM(tb_compra.cantidad) as  suma
FROM `tb_compra`
JOIN `tb_producto` ON `tb_compra`.`id_producto` = `tb_producto`.`id_producto`
GROUP BY `tb_producto`.`producto`
ORDER BY `tb_producto`.`producto` DESC