app/Models/UsersModel.php

SELECT `idusu` AS `id`, `usuario`, `contra`, `idcargo`
FROM `usuario`
WHERE `usuario` = 'esl1'
AND `contra` = '111'
 LIMIT 1
---
    public function loginUser(string $userName, string $pass) : ?object {
        $this->builder->select('idusu AS id, usuario, contra, idcargo');
        $this->builder->where('usuario', $userName);
        $this->builder->where('contra', $pass);
        $this->builder->limit(1);
        $r = $this->builder->get()->getRow();